<?php

function get_apartments()
{
    return [
        0 => [
            'title' => 'Двухместный номер',
            'min_persons' => 2,
            'max_persons' => 3,
            'description' => 'Номер представляет собой небольшую студию-квартиру. В номере есть небольшая кухня с холодильником, электроплитой и необходимым набором посуды. Санузлы в номерах – с душевыми кабинами. Имеется спутниковое ТВ, кондиционер, Wi-Fi, сейф, утюг, гладильная доска, сушилка. Веранды в двухкомнатных номерах позволят уютно расположиться всей семье на трапезу. Шашлык же для этой трапезы легко приготовить на мангале в беседках возле гостиниц.',
            'description-short' => 'норм номер',

            'facilities' => 'Бесплатная автостоянка, Wi-Fi, спутниковое TV, xолодильник, душ, кондиционер, кухня, сейф',
            'rooms_count' => 2,
            'kitchen' => true,
            'bathroom' => true,
            'floor' => 2,
            'furniture' => 'двуспальная кровать, кресло-кровать, шкаф, прикроватные тумбочки, стулья, стол',
            'price' => '1500-2000'
        ],
        1 => [
            'title' => 'Двухместный номер 1',
            'min_persons' => 2,
            'max_persons' => 5,
            'description' => 'Номер представляет собой небольшую студию-квартиру. В номере есть небольшая кухня с холодильником, электроплитой и необходимым набором посуды. Санузлы в номерах – с душевыми кабинами. Имеется спутниковое ТВ, кондиционер, Wi-Fi, сейф, утюг, гладильная доска, сушилка. Веранды в двухкомнатных номерах позволят уютно расположиться всей семье на трапезу. Шашлык же для этой трапезы легко приготовить на мангале в беседках возле гостиниц.',
            'description-short' => 'норм номер',

            'facilities' => 'Бесплатная автостоянка, Wi-Fi, спутниковое TV, xолодильник, душ, кондиционер, кухня, сейф',
            'rooms_count' => 2,
            'kitchen' => true,
            'bathroom' => true,
            'floor' => 2,
            'furniture' => 'двуспальная кровать, кресло-кровать, шкаф, прикроватные тумбочки, стулья, стол',
            'price' => '1500-2000'
        ],
        2 => [
            'title' => 'Двухместный номер 2',
            'min_persons' => 3,
            'max_persons' => 4,
            'description' => 'Номер представляет собой небольшую студию-квартиру. В номере есть небольшая кухня с холодильником, электроплитой и необходимым набором посуды. Санузлы в номерах – с душевыми кабинами. Имеется спутниковое ТВ, кондиционер, Wi-Fi, сейф, утюг, гладильная доска, сушилка. Веранды в двухкомнатных номерах позволят уютно расположиться всей семье на трапезу. Шашлык же для этой трапезы легко приготовить на мангале в беседках возле гостиниц.',
            'description-short' => 'норм номер',

            'facilities' => 'Бесплатная автостоянка, Wi-Fi, спутниковое TV, xолодильник, душ, кондиционер, кухня, сейф',
            'rooms_count' => 2,
            'kitchen' => true,
            'bathroom' => true,
            'floor' => 2,
            'furniture' => 'двуспальная кровать, кресло-кровать, шкаф, прикроватные тумбочки, стулья, стол',
            'price' => '1500-2000'
        ],
        3 => [
            'title' => 'Двухместный номер 3',
            'min_persons' => 6,
            'max_persons' => 8,
            'description' => 'Номер представляет собой небольшую студию-квартиру. В номере есть небольшая кухня с холодильником, электроплитой и необходимым набором посуды. Санузлы в номерах – с душевыми кабинами. Имеется спутниковое ТВ, кондиционер, Wi-Fi, сейф, утюг, гладильная доска, сушилка. Веранды в двухкомнатных номерах позволят уютно расположиться всей семье на трапезу. Шашлык же для этой трапезы легко приготовить на мангале в беседках возле гостиниц.',
            'description-short' => 'норм номер',

            'facilities' => 'Бесплатная автостоянка, Wi-Fi, спутниковое TV, xолодильник, душ, кондиционер, кухня, сейф',
            'rooms_count' => 2,
            'kitchen' => true,
            'bathroom' => true,
            'floor' => 2,
            'furniture' => 'двуспальная кровать, кресло-кровать, шкаф, прикроватные тумбочки, стулья, стол',
            'price' => '1500-2000'
        ],
        4 => [
            'title' => 'Двухместный номер 4',
            'min_persons' => 5,
            'max_persons' => 6,
            'description' => 'Номер представляет собой небольшую студию-квартиру. В номере есть небольшая кухня с холодильником, электроплитой и необходимым набором посуды. Санузлы в номерах – с душевыми кабинами. Имеется спутниковое ТВ, кондиционер, Wi-Fi, сейф, утюг, гладильная доска, сушилка. Веранды в двухкомнатных номерах позволят уютно расположиться всей семье на трапезу. Шашлык же для этой трапезы легко приготовить на мангале в беседках возле гостиниц.',
            'description-short' => 'норм номер',

            'facilities' => 'Бесплатная автостоянка, Wi-Fi, спутниковое TV, xолодильник, душ, кондиционер, кухня, сейф',
            'rooms_count' => 2,
            'kitchen' => true,
            'bathroom' => true,
            'floor' => 2,
            'furniture' => 'двуспальная кровать, кресло-кровать, шкаф, прикроватные тумбочки, стулья, стол',
            'price' => '1500-2000'
        ]

    ];
}

function get_apartments_by_persons($count = 0)
{
    // FIXME Но ведь 1 может залететь в 2-3

    $result = get_apartments();

    if ($count == 0) {
        return $result;
    }

    foreach ($result as $k => $apartment) {
        $min_persons = $apartment['min_persons'];
        $max_persons = $apartment['max_persons'];


        // FIXME open revert
        if (!($min_persons <= $count && $count <= $max_persons)) {
            unset($result[$k]);
        }
    }

    return $result;
}

// fixme test by 404 and null values
function get_apartment_by_id($id = 0) {
    return get_apartments()[$id];
}
